Repository: JFrancoG/SmartShoppingList
Catalog: ios/SmartShoppingList/SmartShoppingList/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: es

source: A submission is awaiting confirmation. Its data is kept so you can retry without duplicating it.
es: Hay un envío pendiente de confirmación. Conservamos sus datos para reintentarlo sin duplicarlo.

source: Accept invitation
es: Aceptar invitación

source: Accepted
es: Aceptada

source: Account
es: Cuenta

source: Add
es: Añadir

source: Add %@ %@ to the list for %@?
es: ¿Añadir %1$@ %2$@ a la lista de %3$@?

source: Add %@ to the list for %@?
es: ¿Añadir %1$@ a la lista de %2$@?

source: Add %lld products
es: Añadir %lld productos

source: Add at least one product to review the draft.
es: Añade al menos un producto para revisar el borrador.

source: Add product
es: Añadir producto

source: Add product manually
es: Añadir producto a mano

source: Add products to start your first shopping list.
es: Añade productos para crear tu primera lista de la compra.

source: Add these products to their lists? %@
es: ¿Añadir estos productos a sus listas? %@

source: Added %@ %@ to the list for %@.
es: Se ha añadido %1$@ %2$@ a la lista de %3$@.

source: Added %@ to the list for %@.
es: Se ha añadido %1$@ a la lista de %2$@.

source: Added %lld products to the list for %@.
es: Se han añadido %lld productos a la lista de %@.

source: Added %lld products to the lists for %@.
es: Se han añadido %lld productos a las listas de %@.

source: Added %lld products to your shopping lists.
es: Se han añadido %lld productos a tus listas de la compra.

source: Adds all reviewed products to the group with the chosen stores.
es: Añade todos los productos revisados al grupo con las tiendas elegidas.

source: Adds this product to the specified store. A new store is created if needed.
es: Añade este producto a la tienda indicada. Si la tienda no existe, se crea una nueva.

source: Another invitation is saved. Resolve or discard it before reviewing the new link.
es: Hay otra invitación guardada. Resuelve o descarta la anterior para revisar el nuevo enlace.

source: Apple Intelligence does not support the app’s current language.
es: Apple Intelligence no admite el idioma actual de la app.

source: Apple Intelligence is currently unavailable on this device.
es: Apple Intelligence no está disponible en este dispositivo en este momento.

source: Apple Intelligence is turned off. You can turn it on in device Settings.
es: Apple Intelligence está desactivado. Puedes activarlo en los Ajustes del dispositivo.

source: Apple did not return the required credentials. Start signing in again.
es: Apple no ha devuelto las credenciales necesarias. Vuelve a iniciar el acceso.

source: Apply
es: Aplicar

source: Back
es: Volver

source: Cancel
es: Cancelar

source: Cancel dictation
es: Cancelar dictado

source: Cancel interpretation
es: Cancelar interpretación

source: Cancel pending product?
es: ¿Cancelar producto pendiente?

source: Changed or unavailable products have been deselected. Review the list and select any products you still want to buy.
es: Se han desmarcado los productos que cambiaron o ya no están pendientes. Revisa la lista y vuelve a marcar los que quieras comprar.

source: Changes the local selection. The purchase is saved when you tap Confirm purchase.
es: Cambia la selección local. La compra se guarda al pulsar Confirmar compra.

source: Changes the local selection. The purchase is saved when you tap Finish shopping.
es: Cambia la selección local. La compra se guarda al pulsar Finalizar compra.

source: Check the products and stores, then add them to your group. New store names create new stores.
es: Comprueba los productos y las tiendas y añádelos al grupo. Los nombres de tiendas nuevas crearán nuevas tiendas.

source: Check this product
es: Revisa este producto

source: Choose a store from the group or confirm the name you reviewed.
es: Elige una tienda del grupo o confirma el nombre que has revisado.

source: Choose stores and confirm
es: Elegir tiendas y confirmar

source: Choose the matching store
es: Elige la tienda correspondiente

source: Close
es: Cerrar

source: Confirm
es: Confirmar

source: Confirm adding to group
es: Confirmar incorporación al grupo

source: Confirm an option for each name. If that name already exists in the group, the same store will be used.
es: Confirma una opción para cada nombre. Si ese nombre ya existe en el grupo, se usará la misma tienda.

source: Confirm products
es: Confirmar productos

source: Confirm purchase
es: Confirmar compra

source: Confirm purchase · %lld
es: Confirmar compra · %lld

source: Confirm stores
es: Confirma las tiendas

source: Confirm the name “%@”
es: Confirmar el nombre «%@»

source: Confirms only the selected products from this store for the whole group.
es: Confirma únicamente los productos seleccionados de esta tienda para todo el grupo.

source: Could not load this store. Refresh to try again.
es: No se ha podido cargar esta tienda. Actualiza para reintentarlo.

source: Create a group
es: Crear un grupo

source: Create group
es: Crear grupo

source: Create invitation
es: Crear invitación

source: Created invitations
es: Invitaciones creadas

source: Created on %@
es: Creada el %@

source: Deselect changed products
es: Desmarcar los productos que han cambiado

source: Dictate
es: Dictar

source: Discard invitation
es: Descartar invitación

source: Dismiss notice
es: Cerrar aviso

source: Draft reviewed. It has not been sent to the group yet.
es: Borrador revisado. Todavía no se ha enviado al grupo.

source: Draft storage
es: Conservación del borrador

source: Each link lets one person join within 24 hours. Share it now: the link cannot be retrieved after reopening the app.
es: Cada enlace permite que una persona se una durante 24 horas. Compártelo ahora: el enlace no se recupera al volver a abrir la app.

source: Edit
es: Editar

source: Edit %@
es: Editar %@

source: Edit product
es: Editar producto

source: Enter a product name.
es: Introduce el nombre del producto.

source: Enter a store name.
es: Introduce el nombre de la tienda.

source: Enter a valid group name of up to 80 Unicode characters.
es: Escribe un nombre de grupo válido de hasta 80 caracteres Unicode.

source: Enter the product name.
es: Escribe el nombre del producto.

source: Expires on %@
es: Vence el %@

source: Find store
es: Buscar tienda

source: Find store by voice
es: Buscar tienda por voz

source: Finish dictation
es: Terminar dictado

source: Finish shopping · %lld
es: Finalizar compra · %lld

source: Finishing dictation…
es: Terminando el dictado…

source: For example: bread at Aldi
es: Por ejemplo: pan en Aldi

source: Group
es: Grupo

source: Group access
es: Acceso al grupo

source: Group name
es: Nombre del grupo

source: Group status
es: Estado del grupo

source: I couldn’t find that store in your group. Try again, correct the text or use the Store selector.
es: No he encontrado esa tienda en tu grupo. Prueba otra vez, corrige el texto o usa el selector de tienda.

source: I have reviewed the current product
es: He revisado el producto actual

source: Include any variants you need, such as lactose-free.
es: Incluye las variantes que necesitas, por ejemplo sin lactosa.

source: Interpret text
es: Interpretar texto

source: Interpreting text…
es: Interpretando el texto…

source: Invitations
es: Invitaciones

source: Keep product
es: Conservar producto

source: Listening…
es: Escuchando…

source: Loading group…
es: Consultando el grupo…

source: Loading pending products…
es: Cargando productos pendientes…

source: Manage invitations
es: Gestionar invitaciones

source: Microphone access is not allowed. Enable it in Settings or use the Store selector.
es: No se permite acceder al micrófono. Actívalo en Ajustes o usa el selector de tienda.

source: Microphone access is not allowed. You can allow it in Settings or enter products manually.
es: El micrófono no tiene permiso. Puedes permitirlo en Ajustes o escribir los productos a mano.

source: More than one store matches this name. Choose which one you mean.
es: Hay varias tiendas con este nombre. Elige a cuál te refieres.

source: More than one store matches. Choose the one you want.
es: Hay varias tiendas coincidentes. Elige la que quieres.

source: Name the products and their store. You can correct them before adding.
es: Di los productos y su tienda. Puedes corregirlos antes de añadirlos.

source: Name: up to 160 characters. Quantity and store: up to 80. Quantity is optional.
es: Nombre: hasta 160 caracteres. Cantidad y tienda: hasta 80. La cantidad es opcional.

source: New link
es: Nuevo enlace

source: New store
es: Nueva tienda

source: New store name
es: Nombre de la nueva tienda

source: No invitations loaded.
es: No hay invitaciones cargadas.

source: No longer needed
es: Ya no lo necesitamos

source: No microphone is available. Type a store name or use the Store selector.
es: No hay un micrófono disponible. Escribe una tienda o usa el selector.

source: No microphone is available. You can continue manually.
es: No hay un micrófono disponible. Puedes continuar a mano.

source: No pending products in this store.
es: No hay productos pendientes en esta tienda.

source: No products were found. Edit the text, dictate again, or add products manually.
es: No se han detectado productos. Puedes editar el texto, repetir el dictado o añadir productos a mano.

source: No speech was recognized. Try again or add products manually.
es: No se ha reconocido ninguna palabra. Inténtalo de nuevo o añade productos a mano.

source: No speech was recognized. Try again or type a store name.
es: No se ha reconocido ninguna palabra. Vuelve a intentarlo o escribe una tienda.

source: No stores loaded. You can confirm a store when adding products.
es: No hay tiendas cargadas. Puedes confirmar una tienda al incorporar productos.

source: Not accepted
es: Sin aceptar

source: Not selected
es: Sin seleccionar

source: Only the person who created the group can manage invitations.
es: Solo la persona que creó el grupo puede gestionar invitaciones.

source: Open Settings
es: Abrir Ajustes

source: Open Settings to join or create a group.
es: Abre Ajustes para unirte a un grupo o crear uno.

source: Open list
es: Ver lista

source: Open your group in Shop to send these products.
es: Accede a tu grupo en Comprar para enviar estos productos.

source: Pending invitation
es: Invitación pendiente

source: Pending products
es: Productos pendientes

source: Pending · %@
es: Pendientes · %@

source: Prepare Sign in with Apple
es: Preparar acceso con Apple

source: Preparing dictation…
es: Preparando el dictado…

source: Preparing microphone…
es: Preparando micrófono…

source: Prevents anyone from using this invitation to join the group.
es: Impide que alguien utilice esta invitación para unirse al grupo.

source: Product
es: Producto

source: Product details
es: Datos del producto

source: Product name
es: Nombre del producto

source: Product name: up to %lld characters.
es: Nombre del producto: máximo %lld caracteres.

source: Products remain in your draft until you confirm adding them to the group.
es: Los productos siguen siendo un borrador hasta que confirmes su incorporación al grupo.

source: Products will only be shared when you confirm this submission.
es: Los productos se compartirán únicamente al confirmar este envío.

source: Products · %lld
es: Productos · %lld

source: Quantity
es: Cantidad

source: Quantity (optional)
es: Cantidad (opcional)

source: Quantity not specified
es: Cantidad no indicada

source: Quantity, optional
es: Cantidad, opcional

source: Quantity: %@
es: Cantidad: %@

source: Quantity: up to %lld characters.
es: Cantidad: máximo %lld caracteres.

source: Recording was interrupted. Correct the recognized text, try again or use the Store selector.
es: La grabación se ha interrumpido. Corrige el texto reconocido, vuelve a intentarlo o usa el selector de tienda.

source: Recording was interrupted. The recognized text is kept; you can continue manually or dictate again.
es: La grabación se ha interrumpido. El texto reconocido se conserva; puedes continuar a mano o volver a dictar.

source: Refresh
es: Actualizar

source: Refresh the list before reviewing this product.
es: Actualiza la lista antes de revisar este producto.

source: Refresh to load this store.
es: Actualiza para cargar esta tienda.

source: Remove
es: Quitar

source: Remove %@
es: Quitar %@

source: Remove %@ from the group’s pending list without recording a purchase?
es: ¿Retirar %@ de los pendientes del grupo sin registrarlo como compra?

source: Remove unsupported control characters from the product details.
es: Elimina los caracteres de control no admitidos de los datos del producto.

source: Restoring draft…
es: Recuperando el borrador…

source: Retries the same submission that is awaiting confirmation.
es: Repite el mismo envío que quedó pendiente de confirmar.

source: Retry submission
es: Reintentar envío

source: Review draft
es: Revisar borrador

source: Review each product, its quantity and store. You can add up to 50 products per batch.
es: Revisa cada producto, su cantidad y la tienda. Puedes añadir hasta 50 productos por lote.

source: Review product edit
es: Revisar edición del producto

source: Review products before adding.
es: Revisa los productos antes de añadirlos.

source: Review submission
es: Revisar envío

source: Review the form data before submitting it again.
es: Revisa los datos del formulario antes de volver a enviarlos.

source: Review the product quantity.
es: Revisa la cantidad del producto.

source: Review your selection
es: Revisa la selección

source: Reviewed products · %lld
es: Productos revisados · %lld

source: Revoke link
es: Revocar enlace

source: Revoked
es: Revocada

source: Save product
es: Guardar producto

source: Save product changes
es: Guardar cambios del producto

source: Saved shopping text
es: Texto de compra guardado

source: Select a store
es: Selecciona una tienda

source: Select an option
es: Selecciona una opción

source: Select the products you are buying. The others will remain pending.
es: Marca los productos que vas a comprar. Los demás seguirán pendientes.

source: Selected
es: Seleccionado

source: Selected: %lld of up to 50
es: Seleccionados: %lld de 50 como máximo

source: Session
es: Sesión

source: Set up your group in Settings to share a shopping list.
es: Configura tu grupo en Ajustes para compartir una lista de la compra.

source: Settings
es: Ajustes

source: Share invitation
es: Compartir invitación

source: Shop
es: Comprar

source: Shopping list
es: Lista de la compra

source: Shopping list notice
es: Aviso de la lista de la compra

source: Shopping text
es: Texto de la compra

source: Shorten the product name: up to 160 Unicode characters.
es: Acorta el nombre del producto: admite hasta 160 caracteres Unicode.

source: Shorten the quantity: up to 80 Unicode characters.
es: Acorta la cantidad: admite hasta 80 caracteres Unicode.

source: Shorten the store name: up to 80 Unicode characters.
es: Acorta la tienda: admite hasta 80 caracteres Unicode.

source: Show list for %@
es: Ver lista de %@

source: Sign in and refresh to check the group before accepting.
es: Accede y actualiza para consultar el grupo antes de aceptar.

source: Sign in with Apple
es: Acceso con Apple

source: Sign in with Apple to create a group or accept an invitation.
es: Accede con Apple para crear un grupo o aceptar una invitación.

source: Sign in with Apple was not completed. Your draft and invitation are kept.
es: El acceso con Apple no se ha completado. El borrador y la invitación se conservan.

source: Sign out
es: Cerrar sesión

source: Sign-out could not be confirmed. Your access is kept so you can retry.
es: No se ha podido confirmar el cierre de sesión. Conservamos el acceso para que puedas reintentarlo.

source: Signed in with Apple
es: Sesión iniciada con Apple

source: Some selected products have changed or are no longer pending.
es: Hay productos seleccionados que han cambiado o ya no están pendientes.

source: Someone else has already used this invitation. Ask for a new link.
es: Otra persona ya ha utilizado esta invitación. Pide un enlace nuevo.

source: Specified store: %@
es: Tienda indicada: %@

source: Specify a store
es: Indica una tienda

source: Specify a store for each product before reviewing the draft.
es: Indica la tienda de cada producto antes de revisar el borrador.

source: Stopping dictation…
es: Deteniendo dictado…

source: Store
es: Tienda

source: Store for “%@”
es: Tienda para «%@»

source: Store name: up to %lld characters.
es: Nombre de la tienda: máximo %lld caracteres.

source: Store query
es: Consulta de tienda

source: Supermarket
es: Supermercado

source: Swipe left on a product to edit or remove it.
es: Desliza un producto a la izquierda para editarlo o quitarlo.

source: Switching stores or leaving this screen does not confirm the purchase. Refresh to check for group changes.
es: Cambiar de tienda o salir de esta pantalla no confirma la compra. Actualiza para consultar cambios del grupo.

source: The Apple Intelligence model is currently unavailable. Your draft is kept; you can retry later or continue manually.
es: El modelo de Apple Intelligence no está disponible en este momento. El borrador se conserva; puedes reintentar más tarde o continuar a mano.

source: The Apple Intelligence model is not ready yet.
es: El modelo de Apple Intelligence todavía no está listo.

source: The draft can contain up to 50 products.
es: El borrador admite hasta 50 productos.

source: The draft could not be saved on this device. Keep the app open; we will retry with your next change.
es: No se ha podido guardar el borrador en este dispositivo. Conserva la app abierta; volveremos a intentarlo con el siguiente cambio.

source: The group connection is not configured yet. You can prepare products in Add.
es: La conexión del grupo todavía no está configurada. Puedes preparar productos en Añadir.

source: The group connection is not configured yet. You can prepare your draft manually.
es: La conexión del grupo todavía no está configurada. Puedes preparar tu borrador a mano.

source: The invitation cannot be opened until the group connection is configured.
es: No se puede abrir la invitación hasta configurar la conexión del grupo.

source: The invitation has been revoked. Ask for a new link.
es: La invitación se ha revocado. Pide un enlace nuevo.

source: The invitation has expired. Ask for a new link.
es: La invitación ha caducado. Pide un enlace nuevo.

source: The list could not be refreshed. Products shown may be out of date. Refresh before continuing.
es: No se ha podido actualizar la lista. Los productos mostrados pueden estar desactualizados. Actualiza antes de continuar.

source: The operation could not be completed. Pending data is kept; try again.
es: No se ha podido completar la operación. Los datos pendientes se conservan; vuelve a intentarlo.

source: The operation is confirmed in the group.
es: La operación se ha confirmado en el grupo.

source: The product change is confirmed in the group.
es: El cambio del producto está confirmado en el grupo.

source: The product change is confirmed, but the list could not be refreshed. Refresh before continuing.
es: El cambio del producto está confirmado, pero no se pudo actualizar la lista. Actualiza antes de continuar.

source: The product has changed. Review its current details before saving your proposal.
es: El producto ha cambiado. Revisa sus datos actuales antes de guardar tu propuesta.

source: The purchase is confirmed, but the list could not be refreshed. Refresh before continuing.
es: La compra se ha confirmado, pero no se ha podido actualizar la lista. Actualiza antes de continuar.

source: The purchase is confirmed. Unselected products remain pending.
es: La compra se ha confirmado. Los productos no seleccionados siguen pendientes.

source: The resource is unavailable or you do not have access. Refresh and try again.
es: El recurso no está disponible o no tienes acceso. Actualiza e inténtalo de nuevo.

source: The result could not be confirmed. The original submission is kept so you can retry without duplicating products.
es: No se ha podido confirmar el resultado. Conservamos el envío original para reintentarlo sin duplicar productos.

source: The result would exceed 50 products. None were added; split the text and review the draft.
es: La propuesta superaría los 50 productos. No se ha añadido ninguno; divide el texto y revisa el borrador.

source: The saved draft could not be restored. It is kept unchanged. Changes in this session will not be saved when you close the app.
es: No se ha podido recuperar el borrador guardado. Lo conservamos sin modificar. Los cambios de esta sesión no se guardarán al cerrar la app.

source: The saved invitation could not be prepared. Unlock the device and try again.
es: No se ha podido preparar la invitación guardada. Desbloquea el dispositivo y vuelve a intentarlo.

source: The server confirmed the batch, but the result still needs to be saved on this device. Retry to complete the same submission.
es: El servidor confirmó el lote, pero falta guardar su resolución en el dispositivo. Reintenta para completar el mismo envío.

source: The service has asked you to wait before retrying. The original submission is kept.
es: El servicio ha pedido esperar antes de reintentar. Conservamos el envío original.

source: The service is currently unavailable. Pending data is kept so you can retry.
es: El servicio no está disponible ahora. Conservamos los datos pendientes para reintentarlo.

source: The submission has a conflict. Refresh and review the data before confirming again.
es: El envío tiene un conflicto. Actualiza y revisa los datos antes de volver a confirmar.

source: The submission is too large. Review the draft before confirming it.
es: El envío es demasiado grande. Revisa el borrador antes de confirmarlo.

source: The text could not be interpreted. Your draft is kept; you can retry or continue manually.
es: No se ha podido interpretar el texto. El borrador se conserva; puedes reintentar o continuar a mano.

source: The text is too long. Interpret a shorter list; your text is kept.
es: El texto es demasiado largo. Interpreta una lista más corta; tu texto se conserva.

source: There are no products in the draft yet.
es: Todavía no hay productos en el borrador.

source: This device does not support Apple Intelligence.
es: Este dispositivo no admite Apple Intelligence.

source: This field contains unsupported control characters.
es: El campo contiene caracteres de control que no se admiten.

source: This invitation link is not valid for this app.
es: El enlace de invitación no es válido para esta app.

source: This link could not be saved. Open it again after unlocking the device.
es: No se ha podido guardar este enlace. Vuelve a abrirlo después de desbloquear el dispositivo.

source: This product is no longer in this store. Close the editor and refresh the list.
es: El producto ya no está en esta tienda. Cierra el editor y actualiza la lista.

source: This product is no longer pending in this store. Your changes were not saved.
es: Este producto ya no está pendiente en esta tienda. Tus cambios no se han guardado.

source: This sign-in attempt could not be verified. Start again.
es: No se ha podido verificar este intento de acceso. Inícialo de nuevo.

source: This sign-in attempt has expired. Prepare Sign in with Apple again.
es: El intento ha caducado. Prepara de nuevo el acceso con Apple.

source: This sign-in attempt is no longer valid. Start signing in with Apple again.
es: Este intento de acceso ya no es válido. Inicia de nuevo el acceso con Apple.
